apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k148_pinmux.h
#define PIN_FTM5_CH0_1            (PIN_ALT2   | PIN_PORTA | PIN25)
#define PIN_FTM5_CH0_2            (PIN_ALT4   | PIN_PORTC | PIN9)
#define PIN_FTM5_CH1_1            (PIN_ALT2   | PIN_PORTA | PIN26)
#define PIN_FTM5_CH1_2            (PIN_ALT4   | PIN_PORTC | PIN8)
#define PIN_FTM5_CH2_1            (PIN_ALT2   | PIN_PORTA | PIN27)
#define PIN_FTM5_CH2_2            (PIN_ALT2   | PIN_PORTC | PIN29)
#define PIN_FTM5_CH3_1            (PIN_ALT2   | PIN_PORTA | PIN28)
#define PIN_FTM5_CH3_2            (PIN_ALT3   | PIN_PORTA | PIN7)
#define PIN_FTM5_CH4_1            (PIN_ALT2   | PIN_PORTA | PIN29)
#define PIN_FTM5_CH4_2            (PIN_ALT2   | PIN_PORTC | PIN30)
#define PIN_FTM5_CH5_1            (PIN_ALT2   | PIN_PORTA | PIN30)
#define PIN_FTM5_CH5_2            (PIN_ALT4   | PIN_PORTA | PIN6)
#define PIN_FTM5_CH6_1            (PIN_ALT2   | PIN_PORTA | PIN31)
#define PIN_FTM5_CH6_2            (PIN_ALT2   | PIN_PORTC | PIN31)
#define PIN_FTM5_CH7_1            (PIN_ALT2   | PIN_PORTB | PIN18)
#define PIN_FTM5_CH7_2            (PIN_ALT2   | PIN_PORTB | PIN19)
#define PIN_FTM5_CH7_3            (PIN_ALT2   | PIN_PORTD | PIN18)
#define PIN_FTM5_FLT0_1           (PIN_ALT4   | PIN_PORTE | PIN12)
#define PIN_FTM5_FLT0_2           (PIN_ALT5   | PIN_PORTA | PIN17)
#define PIN_FTM5_FLT1_1           (PIN_ALT4   | PIN_PORTB | PIN17)
#define PIN_FTM5_FLT1_2           (PIN_ALT4   | PIN_PORTD | PIN17)

#define PIN_FTM6_CH0_1            (PIN_ALT2   | PIN_PORTB | PIN20)
#define PIN_FTM6_CH0_2            (PIN_ALT2   | PIN_PORTD | PIN19)
#define PIN_FTM6_CH0_3            (PIN_ALT5   | PIN_PORTA | PIN18)
#define PIN_FTM6_CH1_1            (PIN_ALT2   | PIN_PORTB | PIN21)
#define PIN_FTM6_CH1_2            (PIN_ALT2   | PIN_PORTD | PIN20)
#define PIN_FTM6_CH2_1            (PIN_ALT2   | PIN_PORTB | PIN22)
#define PIN_FTM6_CH2_2            (PIN_ALT2   | PIN_PORTD | PIN21)
#define PIN_FTM6_CH3_1            (PIN_ALT2   | PIN_PORTB | PIN23)
#define PIN_FTM6_CH3_2            (PIN_ALT2   | PIN_PORTD | PIN22)
#define PIN_FTM6_CH4_1            (PIN_ALT2   | PIN_PORTB | PIN24)
#define PIN_FTM6_CH4_2            (PIN_ALT2   | PIN_PORTD | PIN23)
#define PIN_FTM6_CH5_1            (PIN_ALT2   | PIN_PORTB | PIN25)
#define PIN_FTM6_CH5_2            (PIN_ALT2   | PIN_PORTD | PIN24)
#define PIN_FTM6_CH6_1            (PIN_ALT2   | PIN_PORTB | PIN26)
#define PIN_FTM6_CH6_2            (PIN_ALT2   | PIN_PORTD | PIN25)
#define PIN_FTM6_CH7_1            (PIN_ALT2   | PIN_PORTB | PIN27)
#define PIN_FTM6_CH7_2            (PIN_ALT2   | PIN_PORTD | PIN26)
#define PIN_FTM6_FLT0_1           (PIN_ALT5   | PIN_PORTB | PIN13)
#define PIN_FTM6_FLT0_2           (PIN_ALT5   | PIN_PORTD | PIN31)
#define PIN_FTM6_FLT1_1           (PIN_ALT3   | PIN_PORTD | PIN30)
#define PIN_FTM6_FLT1_2           (PIN_ALT5   | PIN_PORTB | PIN12)

#define PIN_FTM7_CH0_1            (PIN_ALT2   | PIN_PORTB | PIN28)
#define PIN_FTM7_CH0_2            (PIN_ALT2   | PIN_PORTD | PIN27)
#define PIN_FTM7_CH1_1            (PIN_ALT2   | PIN_PORTB | PIN29)
#define PIN_FTM7_CH1_2            (PIN_ALT2   | PIN_PORTD | PIN28)
#define PIN_FTM7_CH2_1            (PIN_ALT2   | PIN_PORTB | PIN30)
#define PIN_FTM7_CH2_2            (PIN_ALT2   | PIN_PORTD | PIN29)
#define PIN_FTM7_CH3_1            (PIN_ALT2   | PIN_PORTB | PIN31)
#define PIN_FTM7_CH3_2            (PIN_ALT2   | PIN_PORTD | PIN30)
#define PIN_FTM7_CH4_1            (PIN_ALT2   | PIN_PORTC | PIN18)
#define PIN_FTM7_CH4_2            (PIN_ALT2   | PIN_PORTD | PIN31)
#define PIN_FTM7_CH5_1            (PIN_ALT2   | PIN_PORTC | PIN19)
#define PIN_FTM7_CH5_2            (PIN_ALT2   | PIN_PORTE | PIN17)
#define PIN_FTM7_CH6_1            (PIN_ALT2   | PIN_PORTC | PIN20)
#define PIN_FTM7_CH6_2            (PIN_ALT2   | PIN_PORTE | PIN18)
#define PIN_FTM7_CH7_1            (PIN_ALT2   | PIN_PORTC | PIN21)
#define PIN_FTM7_CH7_2            (PIN_ALT2   | PIN_PORTE | PIN19)
#define PIN_FTM7_FLT0_1           (PIN_ALT4   | PIN_PORTC | PIN21)
#define PIN_FTM7_FLT0_2           (PIN_ALT5   | PIN_PORTA | PIN15)
#define PIN_FTM7_FLT1_1           (PIN_ALT2   | PIN_PORTC | PIN22)
#define PIN_FTM7_FLT1_2           (PIN_ALT3   | PIN_PORTE | PIN6)

/* FlexIO */

#define PIN_FXIO_D0_1             (PIN_ALT3   | PIN_PORTA | PIN21)
#define PIN_FXIO_D0_2             (PIN_ALT3   | PIN_PORTC | PIN30)
#define PIN_FXIO_D0_3             (PIN_ALT3   | PIN_PORTD | PIN9)
#define PIN_FXIO_D0_4             (PIN_ALT4   | PIN_PORTA | PIN10)
#define PIN_FXIO_D0_5             (PIN_ALT6   | PIN_PORTD | PIN0)
#define PIN_FXIO_D1_1             (PIN_ALT3   | PIN_PORTA | PIN22)
#define PIN_FXIO_D1_2             (PIN_ALT3   | PIN_PORTC | PIN31)
#define PIN_FXIO_D1_3             (PIN_ALT4   | PIN_PORTA | PIN11)
#define PIN_FXIO_D1_4             (PIN_ALT5   | PIN_PORTD | PIN8)
#define PIN_FXIO_D1_5             (PIN_ALT6   | PIN_PORTD | PIN1)
#define PIN_FXIO_D2_1             (PIN_ALT3   | PIN_PORTA | PIN23)
#define PIN_FXIO_D2_2             (PIN_ALT3   | PIN_PORTD | PIN18)
#define PIN_FXIO_D2_3             (PIN_ALT4   | PIN_PORTA | PIN0)
#define PIN_FXIO_D2_4             (PIN_ALT6   | PIN_PORTE | PIN15)
#define PIN_FXIO_D3_1             (PIN_ALT3   | PIN_PORTA | PIN24)
#define PIN_FXIO_D3_2             (PIN_ALT3   | PIN_PORTD | PIN19)
#define PIN_FXIO_D3_3             (PIN_ALT4   | PIN_PORTA | PIN1)
#define PIN_FXIO_D3_4             (PIN_ALT6   | PIN_PORTE | PIN16)
#define PIN_FXIO_D4_1             (PIN_ALT3   | PIN_PORTE | PIN18)
#define PIN_FXIO_D4_2             (PIN_ALT4   | PIN_PORTD | PIN2)
#define PIN_FXIO_D4_3             (PIN_ALT5   | PIN_PORTA | PIN2)
#define PIN_FXIO_D4_4             (PIN_ALT6   | PIN_PORTE | PIN10)
#define PIN_FXIO_D5_1             (PIN_ALT3   | PIN_PORTE | PIN17)
#define PIN_FXIO_D5_2             (PIN_ALT4   | PIN_PORTD | PIN3)
#define PIN_FXIO_D5_3             (PIN_ALT5   | PIN_PORTA | PIN3)
#define PIN_FXIO_D5_4             (PIN_ALT6   | PIN_PORTE | PIN11)
#define PIN_FXIO_D6_1             (PIN_ALT3   | PIN_PORTD | PIN31)
#define PIN_FXIO_D6_2             (PIN_ALT4   | PIN_PORTA | PIN8)
#define PIN_FXIO_D6_3             (PIN_ALT5   | PIN_PORTD | PIN2)
#define PIN_FXIO_D6_4             (PIN_ALT6   | PIN_PORTE | PIN4)
#define PIN_FXIO_D7_1             (PIN_ALT3   | PIN_PORTD | PIN26)
#define PIN_FXIO_D7_2             (PIN_ALT4   | PIN_PORTA | PIN9)
#define PIN_FXIO_D7_3             (PIN_ALT5   | PIN_PORTD | PIN3)
#define PIN_FXIO_D7_4             (PIN_ALT6   | PIN_PORTE | PIN5)

/* JTAG */

#define PIN_JTAG_TCLK             (PIN_ALT7   | PIN_PORTC | PIN4)
#define PIN_JTAG_TDI              (PIN_ALT7   | PIN_PORTC | PIN5)
#define PIN_JTAG_TDO              (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_JTAG_TMS              (PIN_ALT7   | PIN_PORTA | PIN4)

/* LPI2C */

#define PIN_LPI2C0_HREQ_1         (PIN_ALT3   | PIN_PORTB | PIN11)
#define PIN_LPI2C0_HREQ_2         (PIN_ALT3   | PIN_PORTE | PIN1)
#define PIN_LPI2C0_SCL_1          (PIN_ALT2   | PIN_PORTB | PIN7)
#define PIN_LPI2C0_SCL_2          (PIN_ALT3   | PIN_PORTA | PIN3)
#define PIN_LPI2C0_SCLS_1         (PIN_ALT3   | PIN_PORTA | PIN0)
#define PIN_LPI2C0_SCLS_2         (PIN_ALT3   | PIN_PORTB | PIN9)
#define PIN_LPI2C0_SDA_1          (PIN_ALT2   | PIN_PORTB | PIN6)
#define PIN_LPI2C0_SDA_2          (PIN_ALT3   | PIN_PORTA | PIN2)
#define PIN_LPI2C0_SDAS_1         (PIN_ALT3   | PIN_PORTA | PIN1)
#define PIN_LPI2C0_SDAS_2         (PIN_ALT3   | PIN_PORTB | PIN10)

