apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k148_pinmux.h
#define PIN_LPI2C1_HREQ_1         (PIN_ALT3   | PIN_PORTD | PIN12)
#define PIN_LPI2C1_HREQ_2         (PIN_ALT4   | PIN_PORTC | PIN5)
#define PIN_LPI2C1_SCL_1          (PIN_ALT2   | PIN_PORTD | PIN9)
#define PIN_LPI2C1_SCL_2          (PIN_ALT4   | PIN_PORTD | PIN19)
#define PIN_LPI2C1_SCL_3          (PIN_ALT4   | PIN_PORTE | PIN1)
#define PIN_LPI2C1_SCLS_1         (PIN_ALT4   | PIN_PORTA | PIN13)
#define PIN_LPI2C1_SCLS_2         (PIN_ALT4   | PIN_PORTC | PIN17)
#define PIN_LPI2C1_SCLS_3         (PIN_ALT4   | PIN_PORTD | PIN18)
#define PIN_LPI2C1_SDA_1          (PIN_ALT2   | PIN_PORTD | PIN8)
#define PIN_LPI2C1_SDA_2          (PIN_ALT4   | PIN_PORTC | PIN31)
#define PIN_LPI2C1_SDA_3          (PIN_ALT4   | PIN_PORTE | PIN0)
#define PIN_LPI2C1_SDAS_1         (PIN_ALT4   | PIN_PORTA | PIN12)
#define PIN_LPI2C1_SDAS_2         (PIN_ALT4   | PIN_PORTC | PIN16)
#define PIN_LPI2C1_SDAS_3         (PIN_ALT4   | PIN_PORTC | PIN30)

/* LPSPI */

#define PIN_LPSPI0_PCS0_1         (PIN_ALT3   | PIN_PORTB | PIN0)
#define PIN_LPSPI0_PCS0_2         (PIN_ALT4   | PIN_PORTA | PIN26)
#define PIN_LPSPI0_PCS0_3         (PIN_ALT4   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS1_1         (PIN_ALT3   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS1_2         (PIN_ALT4   | PIN_PORTA | PIN31)
#define PIN_LPSPI0_PCS2           (PIN_ALT2   | PIN_PORTE | PIN6)
#define PIN_LPSPI0_PCS3           (PIN_ALT3   | PIN_PORTA | PIN15)
#define PIN_LPSPI0_SCK_1          (PIN_ALT2   | PIN_PORTC | PIN23)
#define PIN_LPSPI0_SCK_2          (PIN_ALT2   | PIN_PORTE | PIN0)
#define PIN_LPSPI0_SCK_3          (PIN_ALT3   | PIN_PORTB | PIN2)
#define PIN_LPSPI0_SCK_4          (PIN_ALT4   | PIN_PORTD | PIN15)
#define PIN_LPSPI0_SIN_1          (PIN_ALT2   | PIN_PORTE | PIN1)
#define PIN_LPSPI0_SIN_2          (PIN_ALT3   | PIN_PORTB | PIN3)
#define PIN_LPSPI0_SIN_3          (PIN_ALT4   | PIN_PORTD | PIN16)
#define PIN_LPSPI0_SOUT_1         (PIN_ALT2   | PIN_PORTE | PIN2)
#define PIN_LPSPI0_SOUT_2         (PIN_ALT3   | PIN_PORTB | PIN1)
#define PIN_LPSPI0_SOUT_3         (PIN_ALT3   | PIN_PORTB | PIN4)
#define PIN_LPSPI0_SOUT_4         (PIN_ALT4   | PIN_PORTA | PIN30)

#define PIN_LPSPI1_PCS0_1         (PIN_ALT3   | PIN_PORTA | PIN26)
#define PIN_LPSPI1_PCS0_2         (PIN_ALT3   | PIN_PORTD | PIN3)
#define PIN_LPSPI1_PCS0_3         (PIN_ALT4   | PIN_PORTA | PIN21)
#define PIN_LPSPI1_PCS0_4         (PIN_ALT5   | PIN_PORTE | PIN1)
#define PIN_LPSPI1_PCS1_1         (PIN_ALT3   | PIN_PORTA | PIN6)
#define PIN_LPSPI1_PCS1_2         (PIN_ALT4   | PIN_PORTA | PIN22)
#define PIN_LPSPI1_PCS1_3         (PIN_ALT4   | PIN_PORTB | PIN18)
#define PIN_LPSPI1_PCS2           (PIN_ALT3   | PIN_PORTA | PIN16)
#define PIN_LPSPI1_PCS3           (PIN_ALT3   | PIN_PORTB | PIN17)
#define PIN_LPSPI1_SCK_1          (PIN_ALT3   | PIN_PORTA | PIN28)
#define PIN_LPSPI1_SCK_2          (PIN_ALT3   | PIN_PORTB | PIN14)
#define PIN_LPSPI1_SCK_3          (PIN_ALT3   | PIN_PORTD | PIN0)
#define PIN_LPSPI1_SCK_4          (PIN_ALT4   | PIN_PORTA | PIN19)
#define PIN_LPSPI1_SIN_1          (PIN_ALT3   | PIN_PORTB | PIN15)
#define PIN_LPSPI1_SIN_2          (PIN_ALT3   | PIN_PORTD | PIN1)
#define PIN_LPSPI1_SIN_3          (PIN_ALT4   | PIN_PORTA | PIN20)
#define PIN_LPSPI1_SIN_4          (PIN_ALT5   | PIN_PORTA | PIN29)
#define PIN_LPSPI1_SOUT_1         (PIN_ALT3   | PIN_PORTA | PIN27)
#define PIN_LPSPI1_SOUT_2         (PIN_ALT3   | PIN_PORTB | PIN16)
#define PIN_LPSPI1_SOUT_3         (PIN_ALT3   | PIN_PORTD | PIN2)
#define PIN_LPSPI1_SOUT_4         (PIN_ALT4   | PIN_PORTA | PIN18)
#define PIN_LPSPI1_SOUT_5         (PIN_ALT5   | PIN_PORTE | PIN0)

#define PIN_LPSPI2_PCS0_1         (PIN_ALT2   | PIN_PORTE | PIN11)
#define PIN_LPSPI2_PCS0_2         (PIN_ALT3   | PIN_PORTA | PIN9)
#define PIN_LPSPI2_PCS0_3         (PIN_ALT3   | PIN_PORTC | PIN14)
#define PIN_LPSPI2_PCS0_4         (PIN_ALT5   | PIN_PORTB | PIN25)
#define PIN_LPSPI2_PCS1_1         (PIN_ALT3   | PIN_PORTE | PIN10)
#define PIN_LPSPI2_PCS1_2         (PIN_ALT5   | PIN_PORTC | PIN19)
#define PIN_LPSPI2_PCS2           (PIN_ALT3   | PIN_PORTE | PIN13)
#define PIN_LPSPI2_PCS3           (PIN_ALT4   | PIN_PORTA | PIN15)
#define PIN_LPSPI2_SCK_1          (PIN_ALT3   | PIN_PORTC | PIN15)
#define PIN_LPSPI2_SCK_2          (PIN_ALT3   | PIN_PORTE | PIN15)
#define PIN_LPSPI2_SCK_3          (PIN_ALT5   | PIN_PORTB | PIN29)
#define PIN_LPSPI2_SIN_1          (PIN_ALT3   | PIN_PORTC | PIN0)
#define PIN_LPSPI2_SIN_2          (PIN_ALT3   | PIN_PORTE | PIN16)
#define PIN_LPSPI2_SIN_3          (PIN_ALT5   | PIN_PORTB | PIN28)
#define PIN_LPSPI2_SOUT_1         (PIN_ALT3   | PIN_PORTA | PIN8)
#define PIN_LPSPI2_SOUT_2         (PIN_ALT3   | PIN_PORTC | PIN1)
#define PIN_LPSPI2_SOUT_3         (PIN_ALT5   | PIN_PORTB | PIN27)

/* LPTimer */

#define PIN_LPTMR0_ALT1           (PIN_ALT3   | PIN_PORTE | PIN11)
#define PIN_LPTMR0_ALT2           (PIN_ALT3   | PIN_PORTD | PIN5)
#define PIN_LPTMR0_ALT3_1         (PIN_ALT3   | PIN_PORTE | PIN2)
#define PIN_LPTMR0_ALT3_2         (PIN_ALT4   | PIN_PORTB | PIN0)

/* LPUARTs */

#define PIN_LPUART0_CTS_1         (PIN_ALT6   | PIN_PORTA | PIN0)
#define PIN_LPUART0_CTS_2         (PIN_ALT6   | PIN_PORTC | PIN8)
#define PIN_LPUART0_RTS_1         (PIN_ALT6   | PIN_PORTA | PIN1)
#define PIN_LPUART0_RTS_2         (PIN_ALT6   | PIN_PORTC | PIN9)
#define PIN_LPUART0_RX_1          (PIN_ALT2   | PIN_PORTB | PIN0)
#define PIN_LPUART0_RX_2          (PIN_ALT4   | PIN_PORTA | PIN28)
#define PIN_LPUART0_RX_3          (PIN_ALT4   | PIN_PORTC | PIN2)
#define PIN_LPUART0_RX_4          (PIN_ALT6   | PIN_PORTA | PIN2)
#define PIN_LPUART0_TX_1          (PIN_ALT2   | PIN_PORTB | PIN1)
#define PIN_LPUART0_TX_2          (PIN_ALT4   | PIN_PORTA | PIN27)
#define PIN_LPUART0_TX_3          (PIN_ALT4   | PIN_PORTC | PIN3)
#define PIN_LPUART0_TX_4          (PIN_ALT6   | PIN_PORTA | PIN3)

#define PIN_LPUART1_CTS_1         (PIN_ALT2   | PIN_PORTE | PIN15)
#define PIN_LPUART1_CTS_2         (PIN_ALT6   | PIN_PORTA | PIN6)
#define PIN_LPUART1_CTS_3         (PIN_ALT6   | PIN_PORTE | PIN2)
#define PIN_LPUART1_RTS_1         (PIN_ALT2   | PIN_PORTE | PIN16)
#define PIN_LPUART1_RTS_2         (PIN_ALT6   | PIN_PORTA | PIN7)
#define PIN_LPUART1_RTS_3         (PIN_ALT6   | PIN_PORTE | PIN6)
#define PIN_LPUART1_RX_1          (PIN_ALT2   | PIN_PORTC | PIN6)
#define PIN_LPUART1_RX_2          (PIN_ALT2   | PIN_PORTC | PIN8)
#define PIN_LPUART1_RX_3          (PIN_ALT3   | PIN_PORTA | PIN19)
#define PIN_LPUART1_RX_4          (PIN_ALT3   | PIN_PORTB | PIN23)
#define PIN_LPUART1_RX_5          (PIN_ALT3   | PIN_PORTD | PIN13)
#define PIN_LPUART1_TX_1          (PIN_ALT2   | PIN_PORTC | PIN7)
#define PIN_LPUART1_TX_2          (PIN_ALT2   | PIN_PORTC | PIN9)
#define PIN_LPUART1_TX_3          (PIN_ALT3   | PIN_PORTA | PIN18)
#define PIN_LPUART1_TX_4          (PIN_ALT3   | PIN_PORTD | PIN14)
#define PIN_LPUART1_TX_5          (PIN_ALT5   | PIN_PORTB | PIN22)

#define PIN_LPUART2_CTS_1         (PIN_ALT3   | PIN_PORTE | PIN9)
#define PIN_LPUART2_CTS_2         (PIN_ALT4   | PIN_PORTC | PIN12)
#define PIN_LPUART2_CTS_3         (PIN_ALT6   | PIN_PORTD | PIN11)
#define PIN_LPUART2_RTS_1         (PIN_ALT3   | PIN_PORTE | PIN3)
#define PIN_LPUART2_RTS_2         (PIN_ALT4   | PIN_PORTC | PIN13)
#define PIN_LPUART2_RTS_3         (PIN_ALT6   | PIN_PORTD | PIN12)
#define PIN_LPUART2_RX_1          (PIN_ALT2   | PIN_PORTA | PIN8)
#define PIN_LPUART2_RX_2          (PIN_ALT2   | PIN_PORTD | PIN6)
#define PIN_LPUART2_RX_3          (PIN_ALT3   | PIN_PORTA | PIN30)
#define PIN_LPUART2_RX_4          (PIN_ALT3   | PIN_PORTD | PIN17)
#define PIN_LPUART2_TX_1          (PIN_ALT2   | PIN_PORTA | PIN9)
#define PIN_LPUART2_TX_2          (PIN_ALT2   | PIN_PORTD | PIN7)
#define PIN_LPUART2_TX_3          (PIN_ALT3   | PIN_PORTE | PIN12)
#define PIN_LPUART2_TX_4          (PIN_ALT4   | PIN_PORTA | PIN29)

/* MII / RMII */

#define PIN_MII_COL_1             (PIN_ALT4   | PIN_PORTB | PIN23)
#define PIN_MII_COL_2             (PIN_ALT4   | PIN_PORTC | PIN14)
#define PIN_MII_CRS_1             (PIN_ALT3   | PIN_PORTB | PIN22)
#define PIN_MII_CRS_2             (PIN_ALT4   | PIN_PORTC | PIN15)
#define PIN_MII_MDC_1             (PIN_ALT5   | PIN_PORTE | PIN8)
#define PIN_MII_MDC_2             (PIN_ALT7   | PIN_PORTB | PIN5)
#define PIN_MII_MDIO              (PIN_ALT5   | PIN_PORTB | PIN4)
#define PIN_MII_RX_DV             (PIN_ALT5   | PIN_PORTC | PIN17)
#define PIN_MII_RX_ER             (PIN_ALT5   | PIN_PORTC | PIN16)
#define PIN_MII_RX_CLK            (PIN_ALT5   | PIN_PORTD | PIN10)
#define PIN_MII_RXD1_1            (PIN_ALT5   | PIN_PORTC | PIN0)
#define PIN_MII_RXD1_2            (PIN_ALT5   | PIN_PORTC | PIN1)
#define PIN_MII_RXD1_3            (PIN_ALT4   | PIN_PORTC | PIN0)
#define PIN_MII_RXD1_4            (PIN_ALT4   | PIN_PORTC | PIN1)
#define PIN_MII_RXD2              (PIN_ALT5   | PIN_PORTD | PIN9)
#define PIN_MII_RXD3              (PIN_ALT3   | PIN_PORTD | PIN8)
#define PIN_MII_TX_CLK            (PIN_ALT5   | PIN_PORTD | PIN11)
#define PIN_MII_TX_EN             (PIN_ALT5   | PIN_PORTD | PIN12)
#define PIN_MII_TX_ER             (PIN_ALT5   | PIN_PORTC | PIN3)
#define PIN_MII_TXD1_1            (PIN_ALT5   | PIN_PORTC | PIN2)
#define PIN_MII_TXD1_2            (PIN_ALT5   | PIN_PORTD | PIN7)
#define PIN_MII_TXD2              (PIN_ALT5   | PIN_PORTD | PIN6)
#define PIN_MII_TXD3              (PIN_ALT5   | PIN_PORTD | PIN5)

