apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k148_pinmux.h
#define PIN_RMII_MDC_1            (PIN_ALT5   | PIN_PORTE | PIN8)
#define PIN_RMII_MDC_2            (PIN_ALT7   | PIN_PORTB | PIN5)
#define PIN_RMII_MDIO             (PIN_ALT5   | PIN_PORTB | PIN4)
#define PIN_RMII_RX_DV            (PIN_ALT5   | PIN_PORTC | PIN17)
#define PIN_RMII_RX_ER            (PIN_ALT5   | PIN_PORTC | PIN16)
#define PIN_RMII_RXD0_1           (PIN_ALT5   | PIN_PORTC | PIN1)
#define PIN_RMII_RXD1_1           (PIN_ALT4   | PIN_PORTC | PIN0)
#define PIN_RMII_RXD0_2           (PIN_ALT5   | PIN_PORTC | PIN0)
#define PIN_RMII_RXD1_2           (PIN_ALT4   | PIN_PORTC | PIN1)
#define PIN_RMII_TX_CLK           (PIN_ALT5   | PIN_PORTD | PIN11)
#define PIN_RMII_TX_EN            (PIN_ALT5   | PIN_PORTD | PIN12)
#define PIN_RMII_TXD0             (PIN_ALT5   | PIN_PORTC | PIN2)
#define PIN_RMII_TXD1             (PIN_ALT5   | PIN_PORTD | PIN7)

#define PIN_RMII_MDC              PIN_RMII_MDC_2
#define PIN_RMII_RXD0             PIN_RMII_RXD0_1
#define PIN_RMII_RXD1             PIN_RMII_RXD1_1

/* NMI */

#define PIN_NMI                   (PIN_ALT7   | PIN_PORTD | PIN3)

/* GPIO */

#define PIN_PTA0                  (PIN_ALT1   | PIN_PORTA | PIN0)
#define PIN_PTA1                  (PIN_ALT1   | PIN_PORTA | PIN1)
#define PIN_PTA2                  (PIN_ALT1   | PIN_PORTA | PIN2)
#define PIN_PTA3                  (PIN_ALT1   | PIN_PORTA | PIN3)
#define PIN_PTA4                  (PIN_ALT1   | PIN_PORTA | PIN4)
#define PIN_PTA5                  (PIN_ALT1   | PIN_PORTA | PIN5)
#define PIN_PTA6                  (PIN_ALT1   | PIN_PORTA | PIN6)
#define PIN_PTA7                  (PIN_ALT1   | PIN_PORTA | PIN7)
#define PIN_PTA8                  (PIN_ALT1   | PIN_PORTA | PIN8)
#define PIN_PTA9                  (PIN_ALT1   | PIN_PORTA | PIN9)
#define PIN_PTA10                 (PIN_ALT1   | PIN_PORTA | PIN10)
#define PIN_PTA11                 (PIN_ALT1   | PIN_PORTA | PIN11)
#define PIN_PTA12                 (PIN_ALT1   | PIN_PORTA | PIN12)
#define PIN_PTA13                 (PIN_ALT1   | PIN_PORTA | PIN13)
#define PIN_PTA14                 (PIN_ALT1   | PIN_PORTA | PIN14)
#define PIN_PTA15                 (PIN_ALT1   | PIN_PORTA | PIN15)
#define PIN_PTA16                 (PIN_ALT1   | PIN_PORTA | PIN16)
#define PIN_PTA17                 (PIN_ALT1   | PIN_PORTA | PIN17)
#define PIN_PTA18                 (PIN_ALT1   | PIN_PORTA | PIN18)
#define PIN_PTA19                 (PIN_ALT1   | PIN_PORTA | PIN19)
#define PIN_PTA20                 (PIN_ALT1   | PIN_PORTA | PIN20)
#define PIN_PTA21                 (PIN_ALT1   | PIN_PORTA | PIN21)
#define PIN_PTA22                 (PIN_ALT1   | PIN_PORTA | PIN22)
#define PIN_PTA23                 (PIN_ALT1   | PIN_PORTA | PIN23)
#define PIN_PTA24                 (PIN_ALT1   | PIN_PORTA | PIN24)
#define PIN_PTA25                 (PIN_ALT1   | PIN_PORTA | PIN25)
#define PIN_PTA26                 (PIN_ALT1   | PIN_PORTA | PIN26)
#define PIN_PTA27                 (PIN_ALT1   | PIN_PORTA | PIN27)
#define PIN_PTA28                 (PIN_ALT1   | PIN_PORTA | PIN28)
#define PIN_PTA29                 (PIN_ALT1   | PIN_PORTA | PIN29)
#define PIN_PTA30                 (PIN_ALT1   | PIN_PORTA | PIN30)
#define PIN_PTA31                 (PIN_ALT1   | PIN_PORTA | PIN31)

#define PIN_PTB0                  (PIN_ALT1   | PIN_PORTB | PIN0)
#define PIN_PTB1                  (PIN_ALT1   | PIN_PORTB | PIN1)
#define PIN_PTB2                  (PIN_ALT1   | PIN_PORTB | PIN2)
#define PIN_PTB3                  (PIN_ALT1   | PIN_PORTB | PIN3)
#define PIN_PTB4                  (PIN_ALT1   | PIN_PORTB | PIN4)
#define PIN_PTB5                  (PIN_ALT1   | PIN_PORTB | PIN5)
#define PIN_PTB6                  (PIN_ALT1   | PIN_PORTB | PIN6)
#define PIN_PTB7                  (PIN_ALT1   | PIN_PORTB | PIN7)
#define PIN_PTB8                  (PIN_ALT1   | PIN_PORTB | PIN8)
#define PIN_PTB9                  (PIN_ALT1   | PIN_PORTB | PIN9)
#define PIN_PTB10                 (PIN_ALT1   | PIN_PORTB | PIN10)
#define PIN_PTB11                 (PIN_ALT1   | PIN_PORTB | PIN11)
#define PIN_PTB12                 (PIN_ALT1   | PIN_PORTB | PIN12)
#define PIN_PTB13                 (PIN_ALT1   | PIN_PORTB | PIN13)
#define PIN_PTB14                 (PIN_ALT1   | PIN_PORTB | PIN14)
#define PIN_PTB15                 (PIN_ALT1   | PIN_PORTB | PIN15)
#define PIN_PTB16                 (PIN_ALT1   | PIN_PORTB | PIN16)
#define PIN_PTB17                 (PIN_ALT1   | PIN_PORTB | PIN17)
#define PIN_PTB18                 (PIN_ALT1   | PIN_PORTB | PIN18)
#define PIN_PTB19                 (PIN_ALT1   | PIN_PORTB | PIN19)
#define PIN_PTB20                 (PIN_ALT1   | PIN_PORTB | PIN20)
#define PIN_PTB21                 (PIN_ALT1   | PIN_PORTB | PIN21)
#define PIN_PTB22                 (PIN_ALT1   | PIN_PORTB | PIN22)
#define PIN_PTB23                 (PIN_ALT1   | PIN_PORTB | PIN23)
#define PIN_PTB24                 (PIN_ALT1   | PIN_PORTB | PIN24)
#define PIN_PTB25                 (PIN_ALT1   | PIN_PORTB | PIN25)
#define PIN_PTB26                 (PIN_ALT1   | PIN_PORTB | PIN26)
#define PIN_PTB27                 (PIN_ALT1   | PIN_PORTB | PIN27)
#define PIN_PTB28                 (PIN_ALT1   | PIN_PORTB | PIN28)
#define PIN_PTB29                 (PIN_ALT1   | PIN_PORTB | PIN29)
#define PIN_PTB30                 (PIN_ALT1   | PIN_PORTB | PIN30)
#define PIN_PTB31                 (PIN_ALT1   | PIN_PORTB | PIN31)

#define PIN_PTC0                  (PIN_ALT1   | PIN_PORTC | PIN0)
#define PIN_PTC1                  (PIN_ALT1   | PIN_PORTC | PIN1)
#define PIN_PTC2                  (PIN_ALT1   | PIN_PORTC | PIN2)
#define PIN_PTC3                  (PIN_ALT1   | PIN_PORTC | PIN3)
#define PIN_PTC4                  (PIN_ALT1   | PIN_PORTC | PIN4)
#define PIN_PTC5                  (PIN_ALT1   | PIN_PORTC | PIN5)
#define PIN_PTC6                  (PIN_ALT1   | PIN_PORTC | PIN6)
#define PIN_PTC7                  (PIN_ALT1   | PIN_PORTC | PIN7)
#define PIN_PTC8                  (PIN_ALT1   | PIN_PORTC | PIN8)
#define PIN_PTC9                  (PIN_ALT1   | PIN_PORTC | PIN9)
#define PIN_PTC10                 (PIN_ALT1   | PIN_PORTC | PIN10)
#define PIN_PTC11                 (PIN_ALT1   | PIN_PORTC | PIN11)
#define PIN_PTC12                 (PIN_ALT1   | PIN_PORTC | PIN12)
#define PIN_PTC13                 (PIN_ALT1   | PIN_PORTC | PIN13)
#define PIN_PTC14                 (PIN_ALT1   | PIN_PORTC | PIN14)
#define PIN_PTC15                 (PIN_ALT1   | PIN_PORTC | PIN15)
#define PIN_PTC16                 (PIN_ALT1   | PIN_PORTC | PIN16)
#define PIN_PTC17                 (PIN_ALT1   | PIN_PORTC | PIN17)
#define PIN_PTC18                 (PIN_ALT1   | PIN_PORTC | PIN18)
#define PIN_PTC19                 (PIN_ALT1   | PIN_PORTC | PIN19)
#define PIN_PTC20                 (PIN_ALT1   | PIN_PORTC | PIN20)
#define PIN_PTC21                 (PIN_ALT1   | PIN_PORTC | PIN21)
#define PIN_PTC22                 (PIN_ALT1   | PIN_PORTC | PIN22)
#define PIN_PTC23                 (PIN_ALT1   | PIN_PORTC | PIN23)
#define PIN_PTC24                 (PIN_ALT1   | PIN_PORTC | PIN24)
#define PIN_PTC25                 (PIN_ALT1   | PIN_PORTC | PIN25)
#define PIN_PTC26                 (PIN_ALT1   | PIN_PORTC | PIN26)
#define PIN_PTC27                 (PIN_ALT1   | PIN_PORTC | PIN27)
#define PIN_PTC28                 (PIN_ALT1   | PIN_PORTC | PIN28)
#define PIN_PTC29                 (PIN_ALT1   | PIN_PORTC | PIN29)
#define PIN_PTC30                 (PIN_ALT1   | PIN_PORTC | PIN30)
#define PIN_PTC31                 (PIN_ALT1   | PIN_PORTC | PIN31)

#define PIN_PTD0                  (PIN_ALT1   | PIN_PORTD | PIN0)
#define PIN_PTD1                  (PIN_ALT1   | PIN_PORTD | PIN1)
#define PIN_PTD2                  (PIN_ALT1   | PIN_PORTD | PIN2)
#define PIN_PTD3                  (PIN_ALT1   | PIN_PORTD | PIN3)
#define PIN_PTD4                  (PIN_ALT1   | PIN_PORTD | PIN4)
#define PIN_PTD5                  (PIN_ALT1   | PIN_PORTD | PIN5)
#define PIN_PTD6                  (PIN_ALT1   | PIN_PORTD | PIN6)
#define PIN_PTD7                  (PIN_ALT1   | PIN_PORTD | PIN7)
#define PIN_PTD8                  (PIN_ALT1   | PIN_PORTD | PIN8)
#define PIN_PTD9                  (PIN_ALT1   | PIN_PORTD | PIN9)
#define PIN_PTD10                 (PIN_ALT1   | PIN_PORTD | PIN10)
#define PIN_PTD11                 (PIN_ALT1   | PIN_PORTD | PIN11)
#define PIN_PTD12                 (PIN_ALT1   | PIN_PORTD | PIN12)
#define PIN_PTD13                 (PIN_ALT1   | PIN_PORTD | PIN13)
#define PIN_PTD14                 (PIN_ALT1   | PIN_PORTD | PIN14)
#define PIN_PTD15                 (PIN_ALT1   | PIN_PORTD | PIN15)
#define PIN_PTD16                 (PIN_ALT1   | PIN_PORTD | PIN16)
#define PIN_PTD17                 (PIN_ALT1   | PIN_PORTD | PIN17)
#define PIN_PTD18                 (PIN_ALT1   | PIN_PORTD | PIN18)
#define PIN_PTD19                 (PIN_ALT1   | PIN_PORTD | PIN19)
#define PIN_PTD20                 (PIN_ALT1   | PIN_PORTD | PIN20)
#define PIN_PTD21                 (PIN_ALT1   | PIN_PORTD | PIN21)
#define PIN_PTD22                 (PIN_ALT1   | PIN_PORTD | PIN22)
#define PIN_PTD23                 (PIN_ALT1   | PIN_PORTD | PIN23)
#define PIN_PTD24                 (PIN_ALT1   | PIN_PORTD | PIN24)
#define PIN_PTD25                 (PIN_ALT1   | PIN_PORTD | PIN25)
#define PIN_PTD26                 (PIN_ALT1   | PIN_PORTD | PIN26)
#define PIN_PTD27                 (PIN_ALT1   | PIN_PORTD | PIN27)
#define PIN_PTD28                 (PIN_ALT1   | PIN_PORTD | PIN28)
#define PIN_PTD29                 (PIN_ALT1   | PIN_PORTD | PIN29)
#define PIN_PTD30                 (PIN_ALT1   | PIN_PORTD | PIN30)
#define PIN_PTD31                 (PIN_ALT1   | PIN_PORTD | PIN31)

#define PIN_PTE0                  (PIN_ALT1   | PIN_PORTE | PIN0)
#define PIN_PTE1                  (PIN_ALT1   | PIN_PORTE | PIN1)
#define PIN_PTE2                  (PIN_ALT1   | PIN_PORTE | PIN2)
#define PIN_PTE3                  (PIN_ALT1   | PIN_PORTE | PIN3)
#define PIN_PTE4                  (PIN_ALT1   | PIN_PORTE | PIN4)
#define PIN_PTE5                  (PIN_ALT1   | PIN_PORTE | PIN5)
#define PIN_PTE6                  (PIN_ALT1   | PIN_PORTE | PIN6)
#define PIN_PTE7                  (PIN_ALT1   | PIN_PORTE | PIN7)
#define PIN_PTE8                  (PIN_ALT1   | PIN_PORTE | PIN8)
#define PIN_PTE9                  (PIN_ALT1   | PIN_PORTE | PIN9)
#define PIN_PTE10                 (PIN_ALT1   | PIN_PORTE | PIN10)
#define PIN_PTE11                 (PIN_ALT1   | PIN_PORTE | PIN11)
#define PIN_PTE12                 (PIN_ALT1   | PIN_PORTE | PIN12)
#define PIN_PTE13                 (PIN_ALT1   | PIN_PORTE | PIN13)
#define PIN_PTE14                 (PIN_ALT1   | PIN_PORTE | PIN14)
#define PIN_PTE15                 (PIN_ALT1   | PIN_PORTE | PIN15)
#define PIN_PTE16                 (PIN_ALT1   | PIN_PORTE | PIN16)
#define PIN_PTE17                 (PIN_ALT1   | PIN_PORTE | PIN17)
#define PIN_PTE18                 (PIN_ALT1   | PIN_PORTE | PIN18)
#define PIN_PTE19                 (PIN_ALT1   | PIN_PORTE | PIN19)
#define PIN_PTE20                 (PIN_ALT1   | PIN_PORTE | PIN20)
#define PIN_PTE21                 (PIN_ALT1   | PIN_PORTE | PIN21)
#define PIN_PTE22                 (PIN_ALT1   | PIN_PORTE | PIN22)
#define PIN_PTE23                 (PIN_ALT1   | PIN_PORTE | PIN23)
#define PIN_PTE24                 (PIN_ALT1   | PIN_PORTE | PIN24)
#define PIN_PTE25                 (PIN_ALT1   | PIN_PORTE | PIN25)
#define PIN_PTE26                 (PIN_ALT1   | PIN_PORTE | PIN26)
#define PIN_PTE27                 (PIN_ALT1   | PIN_PORTE | PIN27)

/* QuadSPI */

#define PIN_QSPI_A_CS             (PIN_ALT6   | PIN_PORTC | PIN3)
#define PIN_QSPI_A_IO0            (PIN_ALT7   | PIN_PORTD | PIN11)
#define PIN_QSPI_A_IO1            (PIN_ALT7   | PIN_PORTD | PIN7)
#define PIN_QSPI_A_IO2            (PIN_ALT7   | PIN_PORTD | PIN12)
#define PIN_QSPI_A_IO3            (PIN_ALT7   | PIN_PORTC | PIN2)
#define PIN_QSPI_A_SCK            (PIN_ALT7   | PIN_PORTD | PIN10)
#define PIN_QSPI_B_CS             (PIN_ALT7   | PIN_PORTC | PIN15)
#define PIN_QSPI_B_IO0            (PIN_ALT7   | PIN_PORTB | PIN4)
#define PIN_QSPI_B_IO1            (PIN_ALT7   | PIN_PORTD | PIN6)
#define PIN_QSPI_B_IO2            (PIN_ALT7   | PIN_PORTD | PIN5)
#define PIN_QSPI_B_IO3            (PIN_ALT7   | PIN_PORTC | PIN3)
#define PIN_QSPI_B_IO4            (PIN_ALT7   | PIN_PORTD | PIN9)
#define PIN_QSPI_B_IO5            (PIN_ALT7   | PIN_PORTD | PIN8)
#define PIN_QSPI_B_IO6            (PIN_ALT7   | PIN_PORTC | PIN17)
#define PIN_QSPI_B_IO7            (PIN_ALT7   | PIN_PORTC | PIN16)
#define PIN_QSPI_B_RWDS           (PIN_ALT7   | PIN_PORTC | PIN0)
#define PIN_QSPI_B_SCK            (PIN_ALT7   | PIN_PORTC | PIN1)

/* Reset */

#define PIN_RESET                 (PIN_ALT7   | PIN_PORTA | PIN5)

/* RTC */

#define PIN_RTC_CLKIN             (PIN_ALT4   | PIN_PORTA | PIN7)
#define PIN_RTC_CLKOUT_1          (PIN_ALT3   | PIN_PORTC | PIN4)
#define PIN_RTC_CLKOUT_2          (PIN_ALT3   | PIN_PORTC | PIN5)
#define PIN_RTC_CLKOUT_3          (PIN_ALT7   | PIN_PORTD | PIN13)

