apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k148_pinmux.h
/* Synchronous Audio Interface (SAI) */

#define PIN_SAI0_BCLK             (PIN_ALT7   | PIN_PORTA | PIN12)
#define PIN_SAI0_D0               (PIN_ALT7   | PIN_PORTA | PIN13)
#define PIN_SAI0_D1               (PIN_ALT7   | PIN_PORTE | PIN1)
#define PIN_SAI0_D2               (PIN_ALT7   | PIN_PORTE | PIN0)
#define PIN_SAI0_D3               (PIN_ALT7   | PIN_PORTA | PIN14)
#define PIN_SAI0_MCLK             (PIN_ALT5   | PIN_PORTD | PIN1)
#define PIN_SAI0_SYNC             (PIN_ALT6   | PIN_PORTA | PIN11)

#define PIN_SAI1_BCLK             (PIN_ALT4   | PIN_PORTB | PIN8)
#define PIN_SAI1_D0               (PIN_ALT4   | PIN_PORTB | PIN9)
#define PIN_SAI1_MCLK             (PIN_ALT4   | PIN_PORTB | PIN10)
#define PIN_SAI1_SYNC             (PIN_ALT7   | PIN_PORTE | PIN2)

/* SWD */

#define PIN_TRACE_SWO             (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_SWD_CLK               (PIN_ALT7   | PIN_PORTC | PIN4)
#define PIN_SWD_DIO               (PIN_ALT7   | PIN_PORTA | PIN4)

/* Test Clock Input (TCLK) */

#define PIN_TCLK0                 (PIN_ALT4   | PIN_PORTB | PIN1)
#define PIN_TCLK1_1               (PIN_ALT3   | PIN_PORTA | PIN5)
#define PIN_TCLK1_2               (PIN_ALT3   | PIN_PORTE | PIN0)
#define PIN_TCLK2                 (PIN_ALT2   | PIN_PORTE | PIN5)

/* Trigger Mux Control (TRGMUX) */

#define PIN_TRGMUX_IN0            (PIN_ALT6   | PIN_PORTB | PIN5)
#define PIN_TRGMUX_IN1            (PIN_ALT6   | PIN_PORTB | PIN4)
#define PIN_TRGMUX_IN2            (PIN_ALT6   | PIN_PORTB | PIN3)
#define PIN_TRGMUX_IN3            (PIN_ALT6   | PIN_PORTB | PIN2)
#define PIN_TRGMUX_IN4            (PIN_ALT6   | PIN_PORTD | PIN3)
#define PIN_TRGMUX_IN5            (PIN_ALT6   | PIN_PORTD | PIN2)
#define PIN_TRGMUX_IN6            (PIN_ALT6   | PIN_PORTE | PIN3)
#define PIN_TRGMUX_IN7            (PIN_ALT6   | PIN_PORTD | PIN5)
#define PIN_TRGMUX_IN8            (PIN_ALT6   | PIN_PORTC | PIN15)
#define PIN_TRGMUX_IN9            (PIN_ALT6   | PIN_PORTC | PIN14)
#define PIN_TRGMUX_IN10           (PIN_ALT6   | PIN_PORTC | PIN11)
#define PIN_TRGMUX_IN11           (PIN_ALT6   | PIN_PORTC | PIN10)
#define PIN_TRGMUX_OUT0           (PIN_ALT7   | PIN_PORTA | PIN1)
#define PIN_TRGMUX_OUT1           (PIN_ALT7   | PIN_PORTD | PIN0)
#define PIN_TRGMUX_OUT2           (PIN_ALT7   | PIN_PORTD | PIN1)
#define PIN_TRGMUX_OUT3           (PIN_ALT7   | PIN_PORTA | PIN0)
#define PIN_TRGMUX_OUT4           (PIN_ALT7   | PIN_PORTE | PIN10)
#define PIN_TRGMUX_OUT5           (PIN_ALT7   | PIN_PORTE | PIN11)
#define PIN_TRGMUX_OUT6           (PIN_ALT7   | PIN_PORTE | PIN15)
#define PIN_TRGMUX_OUT7           (PIN_ALT7   | PIN_PORTE | PIN16)

/* External Crystal */

#define PIN_EXTAL                 (PIN_ANALOG | PIN_PORTB | PIN7)
#define PIN_XTAL                  (PIN_ANALOG | PIN_PORTB | PIN6)

#endif /* __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K148_PINMUX_H */
